//=============================================================================
//
// 地面の処理 [field.cpp]
// Author : 長山拓実
//
//=============================================================================
#include "field.h"
#include "manager.h"
#include "renderer.h"

//=============================================================================
// 静的メンバ変数宣言
//=============================================================================
LPDIRECT3DTEXTURE9 CFeild::m_pTexture = NULL;

//=============================================================================
// 地面の生成処理
//=============================================================================
CFeild *CFeild::Create(D3DXVECTOR3 pos, float fDepth, float fWifth, float fTextureU, float fTextureV)
{
	CFeild *pHole = NULL;

	if (pHole == NULL)
	{
		// 地面クラスの生成
		pHole = new CFeild;

		if (pHole != NULL)
		{
			pHole->SetDepth(fDepth);
			pHole->SetWidth(fWifth);
			pHole->SetTextureU(fTextureU);
			pHole->SetTextureV(fTextureV);
			pHole->SetPos(pos);
			pHole->Init();								// 初期化処理
			pHole->BindTexture(m_pTexture);				// 種類の設定
			pHole->SetCol(D3DXCOLOR(1.0f, 1.0f, 1.0f, 1.0f));				// 種類の設定
		}
	}
	return pHole;
}

//=============================================================================
// 地面クラスのコンストラクタ
//=============================================================================
CFeild::CFeild() : CPolygon(POLYGON_PRIORITY)
{
	// 値をクリア
}

//=============================================================================
// 地面クラスのデストラクタ
//=============================================================================
CFeild::~CFeild()
{
}

//=============================================================================
// 地面の初期化処理
//=============================================================================
HRESULT CFeild::Init(void)
{
	// 2Dオブジェクト初期化処理
	CPolygon::Init();

	// オブジェクトの種類の設定
	SetObjType(CScene::OBJTYPE_FIELD);

	return S_OK;
}

//=============================================================================
// 地面の終了処理
//=============================================================================
void CFeild::Uninit(void)
{
	// 2Dオブジェクト終了処理
	CPolygon::Uninit();
}

//=============================================================================
// 地面の更新処理
//=============================================================================
void CFeild::Update(void)
{
}

//=============================================================================
// 地面の描画処理
//=============================================================================
void CFeild::Draw(void)
{
	// 2Dオブジェクト描画処理
	CPolygon::Draw();
}

//=============================================================================
// 地面のテクスチャ読み込み処理
//=============================================================================
HRESULT CFeild::Load(void)
{
	// レンダラーを取得
	CRenderer *pRenderer;
	pRenderer = CManager::GetRenderer();

	LPDIRECT3DDEVICE9 pDevice = NULL;

	if (pRenderer != NULL)
	{
		pDevice = pRenderer->GetDevice();
	}

	// テクスチャの生成
	D3DXCreateTextureFromFile(pDevice, GROUND_TEXTURE_NAME, &m_pTexture);

	return S_OK;
}

//=============================================================================
// 地面のテクスチャ解放処理
//=============================================================================
void CFeild::Unload(void)
{
	// テクスチャの破棄
	if (m_pTexture != NULL)
	{
		m_pTexture->Release();
		m_pTexture = NULL;
	}
}