//=============================================================================
//
// ゲームクリアロゴの処理 [tutorialLogo.cpp]
// Author : 長山拓実
//
//=============================================================================
#include "gameclearLogo.h"
#include "renderer.h"

//=============================================================================
// 静的メンバ変数宣言
//=============================================================================
LPDIRECT3DTEXTURE9 CGameClearLogo::m_pTexture = NULL;

//=============================================================================
// ゲームクリアロゴの生成処理
//=============================================================================
CGameClearLogo *CGameClearLogo::Create(D3DXVECTOR3 pos, float fWidth, float fHeight)
{
	CGameClearLogo *pGameClearLogo = NULL;

	if (pGameClearLogo == NULL)
	{
		// ゲームクリアロゴクラスの生成
		pGameClearLogo = new CGameClearLogo;

		if (pGameClearLogo != NULL)
		{
			pGameClearLogo->SetPosition(pos);
			pGameClearLogo->SetWidth(fWidth);
			pGameClearLogo->SetHeight(fHeight);
			pGameClearLogo->Init();
			pGameClearLogo->BindTexture(m_pTexture);
		}
	}

	return pGameClearLogo;
}

//=============================================================================
// ゲームクリアロゴクラスのコンストラクタ
//=============================================================================
CGameClearLogo::CGameClearLogo() : CLogo(6)
{
	// 値をクリア
}

//=============================================================================
// ゲームクリアロゴクラスのデストラクタ
//=============================================================================
CGameClearLogo::~CGameClearLogo()
{
}

//=============================================================================
// ゲームクリアロゴ初期化処理
//=============================================================================
HRESULT CGameClearLogo::Init(void)
{
	// 2Dオブジェクト初期化処理
	CLogo::Init();

	CLogo::SetCol(D3DXCOLOR(0.0f, 1.0f, 1.0f, 1.0f));

	return S_OK;
}

//=============================================================================
// ゲームクリアロゴ終了処理
//=============================================================================
void CGameClearLogo::Uninit(void)
{
	// 2Dオブジェクト終了処理
	CLogo::Uninit();
}

//=============================================================================
// ゲームクリアロゴ更新処理
//=============================================================================
void CGameClearLogo::Update(void)
{
}

//=============================================================================
// ゲームクリアロゴ描画処理
//=============================================================================
void CGameClearLogo::Draw(void)
{
	// 2Dオブジェクト描画処理
	CLogo::Draw();
}

//=============================================================================
// ゲームクリアロゴのテクスチャ読み込み処理
//=============================================================================
HRESULT CGameClearLogo::Load(void)
{
	// レンダラーを取得
	CRenderer *pRenderer;
	pRenderer = CManager::GetRenderer();

	LPDIRECT3DDEVICE9 pDevice = NULL;

	if (pRenderer != NULL)
	{
		pDevice = pRenderer->GetDevice();
	}

	// テクスチャの生成
	D3DXCreateTextureFromFile(pDevice, GAMECLEAR_LOGO_NAME, &m_pTexture);

	return S_OK;
}

//=============================================================================
// ゲームクリアロゴのテクスチャ解放処理
//=============================================================================
void CGameClearLogo::Unload(void)
{
	// テクスチャの破棄
	if (m_pTexture != NULL)
	{
		m_pTexture->Release();
		m_pTexture = NULL;
	}
}