//=============================================================================
//
// ゲームオーバーロゴの処理 [gameoverLogo.cpp]
// Author : 長山拓実
//
//=============================================================================
#include "gameoverLogo.h"
#include "renderer.h"

//=============================================================================
// 静的メンバ変数宣言
//=============================================================================
LPDIRECT3DTEXTURE9 CGameOverLogo::m_pTexture = NULL;

//=============================================================================
// ゲームオーバーロゴの生成処理
//=============================================================================
CGameOverLogo *CGameOverLogo::Create(D3DXVECTOR3 pos, float fWidth, float fHeight)
{
	CGameOverLogo *pGameOverLogo = NULL;

	if (pGameOverLogo == NULL)
	{
		// ゲームオーバーロゴクラスの生成
		pGameOverLogo = new CGameOverLogo;

		if (pGameOverLogo != NULL)
		{
			pGameOverLogo->SetPosition(pos);
			pGameOverLogo->SetWidth(fWidth);
			pGameOverLogo->SetHeight(fHeight);
			pGameOverLogo->Init();
			pGameOverLogo->BindTexture(m_pTexture);
		}
	}

	return pGameOverLogo;
}

//=============================================================================
// ゲームオーバーロゴクラスのコンストラクタ
//=============================================================================
CGameOverLogo::CGameOverLogo() : CLogo(6)
{
	// 値をクリア
}

//=============================================================================
// ゲームオーバーロゴクラスのデストラクタ
//=============================================================================
CGameOverLogo::~CGameOverLogo()
{
}

//=============================================================================
// ゲームオーバーロゴ初期化処理
//=============================================================================
HRESULT CGameOverLogo::Init(void)
{
	// 2Dオブジェクト初期化処理
	CLogo::Init();

	CLogo::SetCol(D3DXCOLOR(1.0f, 1.0f, 1.0f, 1.0f));

	return S_OK;
}

//=============================================================================
// ゲームオーバーロゴ終了処理
//=============================================================================
void CGameOverLogo::Uninit(void)
{
	// 2Dオブジェクト終了処理
	CLogo::Uninit();
}

//=============================================================================
// ゲームオーバーロゴ更新処理
//=============================================================================
void CGameOverLogo::Update(void)
{
}

//=============================================================================
// ゲームオーバーロゴ描画処理
//=============================================================================
void CGameOverLogo::Draw(void)
{
	// 2Dオブジェクト描画処理
	CLogo::Draw();
}

//=============================================================================
// ゲームオーバーロゴのテクスチャ読み込み処理
//=============================================================================
HRESULT CGameOverLogo::Load(void)
{
	// レンダラーを取得
	CRenderer *pRenderer;
	pRenderer = CManager::GetRenderer();

	LPDIRECT3DDEVICE9 pDevice = NULL;

	if (pRenderer != NULL)
	{
		pDevice = pRenderer->GetDevice();
	}

	// テクスチャの生成
	D3DXCreateTextureFromFile(pDevice, GAMEOVER_LOGO_NAME, &m_pTexture);

	return S_OK;
}

//=============================================================================
// ゲームオーバーロゴのテクスチャ解放処理
//=============================================================================
void CGameOverLogo::Unload(void)
{
	// テクスチャの破棄
	if (m_pTexture != NULL)
	{
		m_pTexture->Release();
		m_pTexture = NULL;
	}
}