//=============================================================================
//
// プレイヤーの残機ロゴの処理 [playerCross.cpp]
// Author : 長山拓実
//
//=============================================================================
#include "playerCross.h"
#include "renderer.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define PLAYERCROSS_COLOR	(D3DXCOLOR(1.0f, 1.0f, 0.0f, 1.0f))

//=============================================================================
// 静的メンバ変数宣言
//=============================================================================
LPDIRECT3DTEXTURE9 CPlayerCross::m_pTexture = NULL;

//=============================================================================
// ブロックロゴの生成処理
//=============================================================================
CPlayerCross *CPlayerCross::Create(D3DXVECTOR3 pos, float fWidth, float fHeight)
{
	CPlayerCross *pPlayerCross = NULL;

	if (pPlayerCross == NULL)
	{
		// ブロックロゴクラスの生成
		pPlayerCross = new CPlayerCross;

		if (pPlayerCross != NULL)
		{
			pPlayerCross->SetPosition(pos);
			pPlayerCross->SetWidth(fWidth);
			pPlayerCross->SetHeight(fHeight);
			pPlayerCross->Init();
			pPlayerCross->BindTexture(m_pTexture);
		}
	}

	return pPlayerCross;
}

//=============================================================================
// ブロックロゴクラスのコンストラクタ
//=============================================================================
CPlayerCross::CPlayerCross()
{
	// 値をクリア
}

//=============================================================================
// ブロックロゴクラスのデストラクタ
//=============================================================================
CPlayerCross::~CPlayerCross()
{
}

//=============================================================================
// ブロックロゴ初期化処理
//=============================================================================
HRESULT CPlayerCross::Init(void)
{
	// 2Dオブジェクト初期化処理
	CLogo::Init();

	CLogo::SetCol(PLAYERCROSS_COLOR);

	return S_OK;
}

//=============================================================================
// ブロックロゴ終了処理
//=============================================================================
void CPlayerCross::Uninit(void)
{
	// 2Dオブジェクト終了処理
	CLogo::Uninit();
}

//=============================================================================
// ブロックロゴ更新処理
//=============================================================================
void CPlayerCross::Update(void)
{
}

//=============================================================================
// ブロックロゴ描画処理
//=============================================================================
void CPlayerCross::Draw(void)
{
	// 2Dオブジェクト描画処理
	CLogo::Draw();
}

//=============================================================================
// ブロックロゴのテクスチャ読み込み処理
//=============================================================================
HRESULT CPlayerCross::Load(void)
{
	// レンダラーを取得
	CRenderer *pRenderer;
	pRenderer = CManager::GetRenderer();

	LPDIRECT3DDEVICE9 pDevice = NULL;

	if (pRenderer != NULL)
	{
		pDevice = pRenderer->GetDevice();
	}

	// テクスチャの生成
	D3DXCreateTextureFromFile(pDevice, PLAYERCROSS_LOGO_NAME, &m_pTexture);

	return S_OK;
}

//=============================================================================
// ブロックロゴのテクスチャ解放処理
//=============================================================================
void CPlayerCross::Unload(void)
{
	// テクスチャの破棄
	if (m_pTexture != NULL)
	{
		m_pTexture->Release();
		m_pTexture = NULL;
	}
}