//=============================================================================
//
// ランキングのテクスチャの処理 [rankTex.cpp]
// Author : 長山拓実
//
//=============================================================================
#include "rankTex.h"
#include "renderer.h"

//=============================================================================
// 静的メンバ変数宣言
//=============================================================================
LPDIRECT3DTEXTURE9 CRankTex::m_pTexture = NULL;

//=============================================================================
// ランキングのテクスチャの生成処理
//=============================================================================
CRankTex *CRankTex::Create(D3DXVECTOR3 pos, float fWidth, float fHeight)
{
	CRankTex *pRankTex = NULL;

	if (pRankTex == NULL)
	{
		// タイトルロゴクラスの生成
		pRankTex = new CRankTex;

		if (pRankTex != NULL)
		{
			pRankTex->SetPosition(pos);
			pRankTex->SetWidth(fWidth);
			pRankTex->SetHeight(fHeight);
			pRankTex->Init();
			pRankTex->BindTexture(m_pTexture);
		}
	}

	return pRankTex;
}

//=============================================================================
// ランキングのテクスチャクラスのコンストラクタ
//=============================================================================
CRankTex::CRankTex() : CLogo(6)
{
	// 値をクリア
}

//=============================================================================
// ランキングのテクスチャクラスのデストラクタ
//=============================================================================
CRankTex::~CRankTex()
{
}

//=============================================================================
// ランキングのテクスチャ初期化処理
//=============================================================================
HRESULT CRankTex::Init(void)
{
	// 2Dオブジェクト初期化処理
	CLogo::Init();

	return S_OK;
}

//=============================================================================
// ランキングのテクスチャ終了処理
//=============================================================================
void CRankTex::Uninit(void)
{
	// 2Dオブジェクト終了処理
	CLogo::Uninit();
}

//=============================================================================
// ランキングのテクスチャ更新処理
//=============================================================================
void CRankTex::Update(void)
{
}

//=============================================================================
// ランキングのテクスチャ描画処理
//=============================================================================
void CRankTex::Draw(void)
{
	// 2Dオブジェクト描画処理
	CLogo::Draw();
}

//=============================================================================
// ランキングのテクスチャ読み込み処理
//=============================================================================
HRESULT CRankTex::Load(void)
{
	// レンダラーを取得
	CRenderer *pRenderer;
	pRenderer = CManager::GetRenderer();

	LPDIRECT3DDEVICE9 pDevice = NULL;

	if (pRenderer != NULL)
	{
		pDevice = pRenderer->GetDevice();
	}

	// テクスチャの生成
	D3DXCreateTextureFromFile(pDevice, RANKING_NUMBER_NAME, &m_pTexture);

	return S_OK;
}

//=============================================================================
// ランキングのテクスチャ解放処理
//=============================================================================
void CRankTex::Unload(void)
{
	// テクスチャの破棄
	if (m_pTexture != NULL)
	{
		m_pTexture->Release();
		m_pTexture = NULL;
	}
}