//=============================================================================
//
// ランキングロゴの処理 [rankingLogo.cpp]
// Author : 長山拓実
//
//=============================================================================
#include "rankingLogo.h"
#include "renderer.h"

//=============================================================================
// 静的メンバ変数宣言
//=============================================================================
LPDIRECT3DTEXTURE9 CRankingLogo::m_pTexture = NULL;

//=============================================================================
// ランキングロゴの生成処理
//=============================================================================
CRankingLogo *CRankingLogo::Create(D3DXVECTOR3 pos, float fWidth, float fHeight)
{
	CRankingLogo *pTutorialLogo = NULL;

	if (pTutorialLogo == NULL)
	{
		// ランキングロゴクラスの生成
		pTutorialLogo = new CRankingLogo;

		if (pTutorialLogo != NULL)
		{
			pTutorialLogo->SetPosition(pos);
			pTutorialLogo->SetWidth(fWidth);
			pTutorialLogo->SetHeight(fHeight);
			pTutorialLogo->Init();
			pTutorialLogo->BindTexture(m_pTexture);
		}
	}

	return pTutorialLogo;
}

//=============================================================================
// ランキングロゴクラスのコンストラクタ
//=============================================================================
CRankingLogo::CRankingLogo() : CLogo(6)
{
	// 値をクリア
}

//=============================================================================
// ランキングロゴクラスのデストラクタ
//=============================================================================
CRankingLogo::~CRankingLogo()
{
}

//=============================================================================
// ランキングロゴ初期化処理
//=============================================================================
HRESULT CRankingLogo::Init(void)
{
	// 2Dオブジェクト初期化処理
	CLogo::Init();

	CLogo::SetCol(D3DXCOLOR(0.0f, 1.0f, 1.0f, 1.0f));

	return S_OK;
}

//=============================================================================
// ランキングロゴ終了処理
//=============================================================================
void CRankingLogo::Uninit(void)
{
	// 2Dオブジェクト終了処理
	CLogo::Uninit();
}

//=============================================================================
// ランキングロゴ更新処理
//=============================================================================
void CRankingLogo::Update(void)
{
}

//=============================================================================
// ランキングロゴ描画処理
//=============================================================================
void CRankingLogo::Draw(void)
{
	// 2Dオブジェクト描画処理
	CLogo::Draw();
}

//=============================================================================
// ランキングロゴのテクスチャ読み込み処理
//=============================================================================
HRESULT CRankingLogo::Load(void)
{
	// レンダラーを取得
	CRenderer *pRenderer;
	pRenderer = CManager::GetRenderer();

	LPDIRECT3DDEVICE9 pDevice = NULL;

	if (pRenderer != NULL)
	{
		pDevice = pRenderer->GetDevice();
	}

	// テクスチャの生成
	D3DXCreateTextureFromFile(pDevice, RANKING_LOGO_NAME, &m_pTexture);

	return S_OK;
}

//=============================================================================
// ランキングロゴのテクスチャ解放処理
//=============================================================================
void CRankingLogo::Unload(void)
{
	// テクスチャの破棄
	if (m_pTexture != NULL)
	{
		m_pTexture->Release();
		m_pTexture = NULL;
	}
}