//=============================================================================
//
// リザルトの処理 [result.h]
// Author : 長山拓実
//
//=============================================================================
#ifndef _RESULT_H_
#define _RESULT_H_

#include "main.h"
#include "scene.h"
#include "scene2D.h"

//=============================================================================
// 前方宣言
//=============================================================================
class CScene2D;
class CScore;
//class CRenderer;

//=============================================================================
// クラスの定義
//=============================================================================
//==================================================================
// リザルトクラス
//==================================================================
class CResult
{
public:
	CResult();						// コンストラクタ
	~CResult();						// デストラクタ

	static CResult *Create();		// タイトルを生成

	HRESULT Init(void);				// タイトル初期化処理
	void Uninit(void);				// タイトル終了処理
	void Update(void);				// タイトル更新処理
	void Draw(void);				// タイトル描画処理

private:
	static LPDIRECT3DTEXTURE9 m_pTexture;
	//static CScore *m_pScore;
	/*static CRenderer *m_pRenderer;*/
};

#endif