//=============================================================================
//
// スコアロゴの処理 [titleLogo.cpp]
// Author : 長山拓実
//
//=============================================================================
#include "scoreLogo.h"
#include "renderer.h"

//=============================================================================
// 静的メンバ変数宣言
//=============================================================================
LPDIRECT3DTEXTURE9 CScoreLogo::m_pTexture = NULL;

//=============================================================================
// スコアロゴの生成処理
//=============================================================================
CScoreLogo *CScoreLogo::Create(D3DXVECTOR3 pos, float fWidth, float fHeight)
{
	CScoreLogo *pScoreLogo = NULL;

	if (pScoreLogo == NULL)
	{
		// スコアロゴクラスの生成
		pScoreLogo = new CScoreLogo;

		if (pScoreLogo != NULL)
		{
			pScoreLogo->SetPosition(pos);
			pScoreLogo->SetWidth(fWidth);
			pScoreLogo->SetHeight(fHeight);
			pScoreLogo->Init();
			pScoreLogo->BindTexture(m_pTexture);
		}
	}

	return pScoreLogo;
}

//=============================================================================
// スコアロゴクラスのコンストラクタ
//=============================================================================
CScoreLogo::CScoreLogo() : CLogo(6)
{
	// 値をクリア
}

//=============================================================================
// スコアロゴクラスのデストラクタ
//=============================================================================
CScoreLogo::~CScoreLogo()
{
}

//=============================================================================
// スコアロゴ初期化処理
//=============================================================================
HRESULT CScoreLogo::Init(void)
{
	// 2Dオブジェクト初期化処理
	CLogo::Init();

	CLogo::SetCol(D3DXCOLOR(1.0f, 1.0f, 0.0f, 1.0f));

	return S_OK;
}

//=============================================================================
// スコアロゴ終了処理
//=============================================================================
void CScoreLogo::Uninit(void)
{
	// 2Dオブジェクト終了処理
	CLogo::Uninit();
}

//=============================================================================
// スコアロゴ更新処理
//=============================================================================
void CScoreLogo::Update(void)
{
}

//=============================================================================
// スコアロゴ描画処理
//=============================================================================
void CScoreLogo::Draw(void)
{
	// 2Dオブジェクト描画処理
	CLogo::Draw();
}

//=============================================================================
// スコアロゴのテクスチャ読み込み処理
//=============================================================================
HRESULT CScoreLogo::Load(void)
{
	// レンダラーを取得
	CRenderer *pRenderer;
	pRenderer = CManager::GetRenderer();

	LPDIRECT3DDEVICE9 pDevice = NULL;

	if (pRenderer != NULL)
	{
		pDevice = pRenderer->GetDevice();
	}

	// テクスチャの生成
	D3DXCreateTextureFromFile(pDevice, SCORE_LOGO_NAME, &m_pTexture);

	return S_OK;
}

//=============================================================================
// スコアロゴのテクスチャ解放処理
//=============================================================================
void CScoreLogo::Unload(void)
{
	// テクスチャの破棄
	if (m_pTexture != NULL)
	{
		m_pTexture->Release();
		m_pTexture = NULL;
	}
}